
	window.onload = function(e){
		var	cate_data = {
				obj4 : {
					channel:['家装城','居家日用','精品家具','家装建材','国际厨具','装修服务'],
					imglist:{
						brand:['1_1.jpg','1_2.jpg','1_3.jpg','1_4.jpg','1_5.jpg','1_6.jpg','1_7.jpg','1_8.jpg'],
						promotion:['1_1.jpg','1_2.jpg']
					},
					detail:{
						dl1:{
							dt:['厨具'],
							dd:['烹饪锅具','锅具套装','保温杯','刀剪','菜板','厨房配件','水具','酒具','餐具','茶具/咖啡具','保鲜盒']
						},
						dl2:{
							dt:['家纺'],
							dd:['床品','套件','被子','枕芯','蚊帐','凉席','毛巾','浴巾','地毯','地垫','床垫/床褥','毯子','抱枕','靠垫','窗帘/窗纱','床单/床笠','被套','枕巾','枕套','沙发','垫套/椅垫','桌布/罩件','电热毯','布艺','软饰']
						},
						dl3:{
							dt:['生活日用'],
							dd:['收纳用品','雨伞','雨具','净化除味','浴室用品','洗晒/熨烫','缝纫/针织用品','清洁工具']
						},
						dl4:{
							dt:['家装软饰'],
							dd:['装饰字画','装饰摆件','手工/十字绣','相框/照片墙','墙贴/装饰贴','花瓶','花艺','香薰','蜡烛','节庆饰品','钟饰','帘艺','隔断','创意家居','保暖防护']
						},
						dl5:{
							dt:['灯具'],
							dd:['吸顶灯','吊灯','台灯','筒灯','射灯','装饰灯','LED灯','氛围照明','落地灯','庭院灯','应急灯/手电','节能灯']
						},
						dl6:{
							dt:['家具'],
							dd:['卧室家具','客厅家具','餐厅家具','书房家具','儿童家具','储物家具','阳台/户外','办公家具','床','床垫','沙发','电脑椅','衣柜','茶几','电视柜','餐桌','电脑桌','鞋架/衣帽架','儿童桌椅','儿童床','晾衣架']
						},
						dl7:{
							dt:['家装主材'],
							dd:['瓷砖','地板','油漆','涂料','壁纸','涂刷','辅料']
						},
						dl8:{
							dt:['厨房卫浴'],
							dd:['水槽','龙头','淋浴','花洒','马桶','智能马桶盖','厨卫','挂件','浴室柜','浴霸','垃圾处理器']
						},
						dl9:{
							dt:['五金电工'],
							dd:['锁具','电动工具','手动工具','测量工具','劳防用品','开关','插座','门铃','监控安防','配电箱/断路器']
						},
						dl10:{
							dt:['装修定制'],
							dd:['装修','设计','全包','装修局部','装修淋浴','房橱柜','集成吊顶','门窗','壁挂炉','散热器','安装服务']
						}
					}
				},
				obj5 : {
					channel:['男装','女装','内衣','童装童鞋','国际品牌','自营服装'],
					imglist:{
						brand:['1_1.jpg','1_2.jpg','1_3.jpg','1_4.jpg','1_5.jpg','1_6.jpg','1_7.jpg','1_8.jpg'],
						promotion:['1_1.jpg','1_2.jpg']
					},
					detail:{
						dl1:{
							dt:['女装'],
						    dd:['新品推荐','连衣裙','羽绒服','毛呢大衣','针织衫','棉服','卫衣','短外套','皮草','风衣','羊绒衫','牛仔裤','休闲裤','打底裤','中老年女装','大码女装','打底衫','T恤','衬衫','真皮皮衣','小西装','毛衣','半身裙','加绒裤','雪纺衫','仿皮皮衣','马甲短裤','正装裤','旗袍/唐装','婚纱礼服','吊带/背心','时尚套装','当季热卖','设计师/潮牌']
						},
						dl2:{
							dt:['男装'],
							dd:['当季热卖','新品推荐','T恤','牛仔裤','休闲裤','衬衫','短裤','POLO衫','羽绒服','棉服','真皮皮衣','夹克','卫衣','毛呢大衣','大码男装','西服套装','仿皮皮衣','风衣','针织衫','马甲/背心','羊毛衫','羊绒衫','西服','西裤','卫裤/运动裤','工装','设计师/潮牌','唐装/中山装','中老年男装','加绒裤']
						},
						dl3:{
							dt:['内衣'],
							dd:['文胸','睡衣/家居服','男士内裤','女士内裤','吊带/背心','文胸套装','情侣睡衣','塑身美体','少女文胸','休闲棉袜','商务男袜','连裤袜/丝袜','美腿袜','打底裤袜','抹胸','内衣配件','大码内衣','打底衫','泳衣','秋衣','秋裤','保暖内衣','情趣内衣']
						},
						dl4:{
							dt:['配饰'],
							dd:['女士围巾/披肩','男士丝巾/围巾','光学镜架/镜片','太阳镜','防辐射眼镜','老花镜','游泳镜','领带/领结/领带夹','毛线帽','棒球帽','贝雷帽','鸭舌帽','礼帽','遮阳帽','遮阳伞/雨伞','男士腰带/礼盒','女士腰带/礼盒','袖扣','真皮手套','毛线手套','围巾/手套/帽子套装','口罩','耳罩/耳包','毛线/布面料','钥匙扣']
						},
						dl5:{
							dt:['童装'],
							dd:['套装','卫衣','裤子','外套/大衣','毛衣/针织衫','衬衫','户外/运动服','T恤','裙子','亲子装','礼服/演出服','羽绒服','棉服','内衣裤','配饰','家居服','马甲','袜子','民族服装']
						},
						dl6:{
							dt:['童鞋'],
							dd:['运动鞋','靴子','帆布鞋','皮鞋','棉鞋','凉鞋','拖鞋']
						}
					}
				},
				obj6 : {
					channel:['清洁用品','美妆馆','个护馆','妆比社','全球购美妆','宠物馆'],
					imglist:{
						brand:['1_1.jpg','1_2.jpg','1_3.jpg','1_4.jpg','1_5.jpg','1_6.jpg','1_7.jpg','1_8.jpg'],
						promotion:['1_1.jpg','1_2.jpg']
					},
					detail:{
						dl1:{
							dt:['面部护肤'],
							dd:['补水保湿','卸妆','洁面','爽肤水','乳液','面霜精华','眼霜','防晒','面膜','剃须','套装']},
						dl2:{   
							dt:['洗发护发'],
						    dd:['洗发','护发','染发','造型','假发','美发','工具','套装']},
						dl3:{
							dt:['身体护理'],
						    dd:['补水保湿','沐浴','润肤','精油','颈部','手足','纤体','塑形','美胸','套装']},
						dl4:{
							dt:['口腔护理'],
						    dd:['牙膏/牙粉','牙刷/牙线','漱口水','套装']},
						dl5:{
							dt:['女性护理'],
						    dd:['卫生巾','卫生护','垫私密护理','脱毛膏']},
						dl6:{
							dt:['香水彩妆'],
						    dd:['BB霜','化妆棉','女士香水','男士香水','底妆','眉笔','睫毛膏','眼线','眼影','唇膏/彩','腮红','美甲','美妆工具','套装']},
						dl7:{
							dt:['清洁用品'],
						    dd:['纸品','湿巾','衣物','清洁清洁工具','家庭清洁','一次性用品','驱虫用品','皮具护理']},
						dl8:{
							dt:['宠物生活'],
						    dd:['水族世界','狗粮','猫粮','猫狗罐头','狗零食','猫零食','医疗保健','宠物玩具','宠物服饰','猫狗窝','洗护','美容','猫砂/猫砂盆','狗厕所/尿垫','宠物牵引','食具','水具','小宠用品']}
					}
				},
				obj7 : {
						channel:['自营鞋靴','自营箱包','时尚鞋包','国际珠宝馆','奢侈品','收藏投资'],
						imglist:{
							brand:['1_1.jpg','1_2.jpg','1_3.jpg','1_4.jpg','1_5.jpg','1_6.jpg','1_7.jpg','1_8.jpg'],
							promotion:['1_1.jpg','1_2.jpg']
						},
						detail: {
							dl1:{
								dt:['时尚女鞋'],
								dd:['新品推荐','单鞋','休闲鞋','帆布鞋','妈妈鞋','布鞋/绣花鞋','女靴','踝靴','马丁靴','雪地靴','雨鞋/雨靴','高跟鞋','凉鞋','拖鞋/人字拖','鱼嘴鞋','内增高','坡跟鞋','防水台','松糕鞋','鞋配件']
							},
							dl2:{
								dt:['潮流女包'],

								dd:['真皮包','单肩包','手提包','斜挎包','双肩包','钱包','手拿包','卡包/零钱包','钥匙包']
							},
							dl3:{
								dt:['精品男包'],

								dd:['男士钱包','双肩包','单肩/斜挎包','商务公文包','男士手包','卡包','名片夹','钥匙包']
							},
							dl4:{
								dt:['功能箱包'],

								dd:['拉杆箱','拉杆包','旅行包','电脑包','休闲运动包','书包','登山包','腰包/胸包','旅行配件','相机包','妈咪包']
							},
							dl5:{
								dt:['奢侈品'],

								dd:['箱包','钱包','服饰','腰带','鞋靴','太阳镜/眼镜框','饰品配件']
							},
							dl6:{
								dt:['精选大牌'],

								dd:['GUCCI','COACH','雷朋','施华洛世奇','MK','阿玛尼','菲拉格慕','VERSACE','普拉达','巴宝莉','万宝龙']
							},
							dl7:{
								dt:['钟表'],

								dd:['天梭','浪琴','欧米茄','泰格','豪雅','DW','卡西','欧西','铁城','天王','瑞表','国表','日韩表','欧美表','德表','儿童手表','智能手表','闹钟','挂钟','座钟','钟表配件']
							},
							dl8:{
								dt:['珠宝首饰'],

								dd:['黄金','K金','时尚饰品','钻石','翡翠','玉石','银饰','水晶','玛瑙','彩宝','铂金','木手串/把件','珍珠','发饰']
							},
							dl9:{
								dt:['金银投资'],

								dd:['投资金','投资银','投资收藏','黄金托管']
							}
						}
					
				},
				obj8 : {
					channel:['体育服务','运动城','户外馆','健身房','骑行馆','钟表城'],
					imglist:{
						brand:['1_1.jpg','1_2.jpg','1_3.jpg','1_4.jpg','1_5.jpg','1_6.jpg','1_7.jpg','1_8.jpg'],
						promotion:['1_1.jpg','1_2.jpg']
					},
					detail:{
						dl1:{
							dt:['流行男鞋'],
							dd:['新品推荐','休闲鞋','商务','休闲鞋','正装鞋','帆布鞋','凉鞋','拖鞋','功能鞋','增高鞋','工装鞋','雨鞋','传统布鞋','男靴','鞋配件']
						},
						dl2:{
							dt:['运动鞋包'],
							dd:['跑步鞋','休闲鞋','篮球鞋','帆布鞋','板鞋','拖鞋','运动包','足球鞋','乒羽网鞋','训练鞋']
						},
						dl3:{
							dt:['运动服饰'],
							dd:['羽绒服','运动套装','运动裤','卫衣/套头','衫夹克/风衣','T恤','运动配饰','棉服','紧身衣','运动背心','乒羽网服']
						},
						dl4:{
							dt:['健身训练'],
							dd:['跑步机','动感单车','健身车','椭圆机','综合训练器','划船机','甩脂机','倒立机','武术','搏击','踏步机','哑铃','仰卧板/收腹机','瑜伽用品','舞蹈用品','运动护具','健腹轮','拉力器/臂力器','跳绳','引体向上器']
						},
						dl5:{
							dt:['骑行运动'],
							dd:['山地车','公路车','折叠车','骑行服','电动车','电动滑板车','城市自行车','平衡车','穿戴装备','自行车配件']
						},
						dl6:{
							dt:['体育用品'],
							dd:['乒乓球','羽毛球','篮球','足球','轮滑','滑板','网球','高尔夫','台球','排球','棋牌','麻将','民俗运动','其它']
						},
						dl7:{
							dt:['户外鞋服'],
							dd:['户外','风衣','徒步鞋','T恤','冲锋衣裤','速干衣裤','越野跑鞋','滑雪服','羽绒服/棉服','休闲衣裤','抓绒衣裤','溯溪鞋','沙滩/凉拖','休闲鞋','软壳衣裤','功能内衣','军迷服饰','登山鞋','工装鞋','户外袜']
						},
						dl8:{
							dt:['户外装备'],
							dd:['背包','帐篷/垫子','望远镜','烧烤用具','便携桌椅','床','户外配饰','军迷用品','野餐用品','睡袋/吊床','救援装备','户外照明','旅行装备','户外工具','户外仪表','登山攀岩','极限户外','冲浪潜水','滑雪装备']
						},
						dl9:{
							dt:['垂钓用品'],
							dd:['钓竿','鱼线','浮漂','鱼饵','钓鱼配件','渔具包','钓箱','钓椅','鱼线','轮钓','鱼灯','辅助装备']
						},
						dl10:{
							dt:['游泳用品'],
							dd:['女士泳衣','比基尼','男士泳衣','泳镜','游泳圈','游泳包','防水包','泳帽','游泳配件']
						}
					}
					
				},
				obj9 : {
					channel:['全新汽车','车管家','旗舰店','二手车','直营店','油卡充值'],
					imglist:{
						brand:['1_1.jpg','1_2.jpg','1_3.jpg','1_4.jpg','1_5.jpg','1_6.jpg','1_7.jpg','1_8.jpg'],
						promotion:['1_1.jpg','1_2.jpg']
					},
					detail:{
						dl1:{
							dt:['房产'],
							dd:['最新开盘','普通住宅','别墅','商业','办公','海外房产','文旅地产']
						},
						dl2:{
							dt:['汽车车型'],
							dd:['微型车','小型车','紧凑型车','中型车','中大型车','豪华车','MPVSUV','跑车']
						},
						dl3:{
							dt:['汽车价格'],
							dd:['5万以下','5-8万','8-10万','10-15万','15-25万','25-40万','40万以上']
						},
						dl4:{
							dt:['汽车品牌'],
							dd:['宝马','一汽-大众','上汽大众','沃尔沃','五菱','宝骏','东风','启辰','长安']
						},
						dl5:{
							dt:['维修保养'],
							dd:['机油','轮胎','添加剂','防冻液','滤清器','蓄电池','雨刷','刹车片/盘','火花塞','车灯','轮毂','维修配件','汽车玻璃','减震器','正时皮带','汽车喇叭','汽修工具','改装配件','原厂件']
						},
						dl6:{
							dt:['汽车装饰'],
							dd:['座垫','座套','脚垫','头枕','腰靠','方向盘套','后备箱垫','车载支架','车钥匙扣','香水','炭包/净化剂','扶手箱','挂件','摆件','车用收纳袋/盒','遮阳/雪挡','车衣','车贴踏板','行李架/箱','雨眉','装饰条','装饰灯','功能小件','车身装饰件']
						},
						dl7:{
							dt:['车载电器'],
							dd:['行车记录仪','车载充电器','车机导航','车载蓝牙','智能驾驶','对讲电台','倒车雷达','导航仪','安全预警仪','车载净化器','车载吸尘器','汽车音响','车载冰箱','应急电源','逆变器','车载影音','车载生活电器','车载电器配件']
						},
						dl8:{
							dt:['美容清洗'],
							dd:['洗车机','洗车水枪','玻璃水','清洁剂','镀晶镀膜','车蜡','汽车贴膜','底盘装甲','补漆笔','毛巾掸子','洗车配件']
						},
						dl9:{
							dt:['安全自驾'],
							dd:['胎压监测','充气泵','灭火器','车载床','应急救援','防盗设备','自驾野营','摩托车','摩托周边','保温箱','储物箱']
						},
						dl10:{
							dt:['汽车服务'],
							dd:['保养','维修','清洗','美容','功能升级','改装服务','ETC','驾驶培训','油卡充值','加油卡']
						}
					}
				},
				obj10 : {
					channel:['母婴','玩具乐器','品牌街','亲子馆','全球购母婴'],
					imglist:{
						brand:['1_1.jpg','1_2.jpg','1_3.jpg','1_4.jpg','1_5.jpg','1_6.jpg','1_7.jpg','1_8.jpg'],
						promotion:['1_1.jpg','1_2.jpg']
					},
					detail:{
						dl1:{
							dt:['奶粉'],
							dd:['1段','2段','3段','4段','孕妈奶粉','特殊配方','奶粉','有机奶粉']
						},
						dl2:{
							dt:['营养辅食'],
							dd:['米粉/菜粉','面条/粥','果泥/果汁','益生菌/初乳','DHA','钙铁锌/维生素','清火/开胃','宝宝零食']
						},
						dl3:{
							dt:['尿裤湿巾'],
							dd:['NB','S','M','L','XL','XXL','拉拉裤','成人尿裤','婴儿湿巾']
						},
						dl4:{
							dt:['喂养用品'],
							dd:['奶瓶','奶嘴','吸奶器','暖奶','消毒','辅食','料理机','牙胶','安抚食物','存储儿童餐具','水壶/水杯','围兜/防溅衣']
						},
						dl5:{
							dt:['洗护用品'],
							dd:['宝宝护肤','日常护理','洗发沐浴','洗澡用具','洗衣液/皂','理发器','婴儿口腔清洁','座便器','驱蚊防晒']
						},
						dl6:{
							dt:['寝居服饰'],
							dd:['睡袋/抱被','家居床品','安全防护','爬行垫','婴儿内衣','婴儿礼盒','婴儿鞋帽袜','婴儿外出服']
						},
						dl7:{
							dt:['妈妈专区'],
							dd:['防辐射服','孕妈装','孕妇护肤','妈咪包/背婴带','待产护理','产后塑身','文胸/内裤','防溢乳垫','孕期营养']
						},
						dl8:{
							dt:['童车童床'],
							dd:['安全座椅','婴儿推车','婴儿床','婴儿床垫','餐椅','学步车','三轮车','自行车','扭扭车','滑板车','电动车']
						},
						dl9:{
							dt:['玩具'],
							dd:['适用年龄','遥控/电动','益智玩具','积木拼插','动漫玩具','毛绒布艺','模型玩具','健身玩具','娃娃玩具','绘画/DIY','创意减压']
						},
						dl10:{
							dt:['乐器'],
							dd:['钢琴','电钢琴','电子琴','吉他','尤克里里','打击乐器','西洋管弦','民族乐器','乐器配件']
						}
					}
				},
				obj11 : {
					channel:['生鲜','食品饮料','酒类','地方特产','全球购美食'],
					imglist:{
						brand:['1_1.jpg','1_2.jpg','1_3.jpg','1_4.jpg','1_5.jpg','1_6.jpg','1_7.jpg','1_8.jpg'],
						promotion:['1_1.jpg','1_2.jpg']
					},
					detail:{
						dl1:{
							dt:['新鲜水果'],
							dd:['苹果','香蕉','梨','橙子','奇异果/猕猴桃','火龙果','榴莲','车厘子','百香果','草莓','国产水果','进口水果']
						},
						dl2:{
							dt:['蔬菜蛋品'],
							dd:['蛋品','叶菜类','根茎类','葱姜蒜椒','鲜菌菇','茄果瓜类','半加工蔬菜','半加工豆制品','玉米','山药','地瓜/红薯']
						},
						dl3:{
							dt:['精选肉类'],
							dd:['猪肉','牛肉','羊肉','鸡肉','鸭肉','冷鲜肉','特色肉类','内脏类','冷藏','熟食','牛排','牛腩','鸡翅']
						},
						dl4:{
							dt:['海鲜水产'],
							dd:['鱼类','虾类','蟹类','贝类','海参','活鲜特色','水产','海产','干货','三文鱼','小龙虾','大闸蟹','海产礼盒']
						},
						dl5:{
							dt:['冷饮冻食'],
							dd:['水饺/馄饨','汤圆/元宵','面点','烘焙半成品','奶酪/黄油','方便速食','火锅丸串','冰淇淋','冷藏果蔬汁','低温乳品']
						},
						dl6:{
							dt:['中外名酒'],
							dd:['白酒','葡萄酒','洋酒','啤酒','黄酒/养生酒','收藏酒/陈年老酒']
						},
						dl7:{
							dt:['进口食品'],
							dd:['牛奶','饼干','蛋糕糖/巧克力','零食','水','饮料','咖啡粉','冲调品','油','方便食品','米面','调味']
						},
						dl8:{
							dt:['休闲食品'],
							dd:['营养零食','休闲零食','坚果','炒货','肉干','肉脯','熟食','腊味','蜜饯','果干','糖果/巧克力','饼干','蛋糕']
						},
						dl9:{
							dt:['地方特产'],
							dd:['华北','华东','华南','华中','东北','西北','西南']
						},
						dl10:{
							dt:['茗茶'],
							dd:['铁观音','普洱','龙井','绿茶','红茶','乌龙','茶花','草茶','花果茶','黑茶','白茶','养生茶','其他茶']
						},
						dl11:{
							dt:['饮料冲调'],
							dd:['饮料','牛奶','酸奶','饮用水','咖啡/奶茶','蜂蜜/柚子茶','冲饮谷物','成人奶粉']
						},
						dl12:{
							dt:['粮油调味'],
							dd:['米面','杂粮','食用油','调味品','南北干货','方便食品','烘焙原料','有机食品']
						}
					}
					
				},
				obj12 : {
					channel:['京东礼品火机烟具鲜花京东农服同城绿植园林园艺'],
					imglist:{
						brand:['1_1.jpg','1_2.jpg','1_3.jpg','1_4.jpg','1_5.jpg','1_6.jpg','1_7.jpg','1_8.jpg'],
						promotion:['1_1.jpg','1_2.jpg']
					},
					detail:{
						dl1:{
							dt:['火机烟具'],
							dd:['电子烟','烟油','打火机','烟嘴','烟盒','烟斗']
						},
						dl2:{
							dt:['礼品'],
							dd:['创意礼品','电子礼品','工艺礼品','美妆礼品','婚庆','节庆','礼盒','礼券','礼品','定制军刀','军具','古董','文玩收藏品','礼品文具','熏香','京东卡']
						},
						dl3:{
							dt:['鲜花速递'],
							dd:['鲜花','每周一花','永生花','香皂花','卡通花','束干花']
						},
						dl4:{
							dt:['绿植园艺'],
							dd:['绿植','盆栽','多肉植物','花卉','苗木','种子','种球','花盆','花器','园艺','土肥','园艺工具','园林机械']
						},
						dl5:{
							dt:['种子'],
							dd:['花草林木类','蔬菜/菌类','瓜果类','大田作物类']
						},
						dl6:{
							dt:['农药'],
							dd:['杀虫剂','杀菌剂','除草剂','植物生长调节剂']
						},
						dl7:{
							dt:['肥料'],
							dd:['氮/磷/钾肥','复合肥','有机肥','生物菌','肥水溶/叶面肥']
						},
						dl8:{
							dt:['畜牧养殖'],
							dd:['预混料','全价料','浓缩料','饲料','添加剂','中兽药','西兽药','兽医器具','生产/运输器具']
						},
						dl9:{
							dt:['农机农具'],
							dd:['微耕机','喷雾器','割草机','农机','整机','农机配件','小型农机具','农膜','农技服务']
						}
					}
					
				},
				obj13:{
					channel:['专科用药','滋补养生','膳食补充','健康监测','两性情话','靓眼视界'],
					imglist:{
						brand:['1_1.jpg','1_2.jpg','1_3.jpg','1_4.jpg','1_5.jpg','1_6.jpg','1_7.jpg','1_8.jpg'],
						promotion:['1_1.jpg','1_2.jpg']
					},
					detail:{
						dl1:{
							dt:['中西药品'],
							dd:['感冒咳嗽','补肾壮阳','补气养血','止痛镇痛','耳鼻喉用药','眼科用药','口腔用药','皮肤用药','肠胃消化','风湿','骨外伤','维生素/钙','男科/泌尿','妇科用药','儿科用药','心脑血管','避孕药','肝胆用药','中风/心绞痛','糖尿病','皮肤/妇科炎症','性功能障碍','肝炎','高血压/血脂','痛风/关节病','前列腺/肾炎']
							},
						dl2:{
							dt:['营养健康'],
							dd:['调节免疫','调节三高','缓解疲劳','美体塑身','美容养颜','肝肾养护','肠胃养护','明目益智','骨骼健康','改善睡眠']
							},
						dl3:{
							dt:['营养成分'],
							dd:['维生素/矿物质','蛋白质','鱼油/磷脂','螺旋藻','番茄红素','叶酸','葡萄籽','左旋肉碱辅酶','Q10','益生菌','玛咖','膳食纤维','牛初乳','胶原蛋白','大豆异黄酮','芦荟提取酵素']
							},
						dl4:{
							dt:['滋补养生'],
							dd:['阿胶蜂蜜/蜂产品','枸杞燕窝','冬虫夏草','人参/西洋参','三七','鹿茸','雪蛤','青钱柳','石斛/枫斗','灵芝/孢子粉','当归','养生茶饮','药食同源']
							},
						dl5:{
							dt:['计生情趣'],
							dd:['避孕套','排卵验孕','润滑液','男用延时','飞机杯','倒模','仿真娃娃','震动棒','跳蛋','仿真阳具','情趣内衣']
							},
						dl6:{
							dt:['保健器械'],
							dd:['血压计','血糖仪','血氧仪','体温计','体重秤','胎心仪','制氧机','呼吸机','雾化器','助听器','轮椅拐杖','护理床','中医保健','养生器械','理疗仪','家庭护理','智能健康']
							},
						dl7:{
							dt:['护理护具'],
							dd:['口罩','眼罩/耳塞','跌打损伤','暖贴','鼻喉护理','眼部保健','美体护理']
							},
						dl8:{
							dt:['隐形眼镜'],
							dd:['透明','隐形','彩色','隐形护理液','眼镜配件']
							},
						dl9:{
							dt:['健康服务'],
							dd:['体检套餐','口腔齿科','基因检测','孕产服务','美容塑型']
							}
					}
				},
				obj14:{
					channel:['图书频道','邮币商城','音像','电子书','图书榜','文娱寄卖商城'],
					imglist:{
						brand:['1_1.jpg','1_2.jpg','1_3.jpg','1_4.jpg','1_5.jpg','1_6.jpg','1_7.jpg','1_8.jpg'],
						promotion:['1_1.jpg','1_2.jpg']
					},
					detail:{
						dl1:{
							dt:['邮币'],
							dd:['邮票钱币邮资封片磁卡票证礼品册']
						},
						dl2:{
							dt:['少儿'],
							dd:['0-2岁','3-6岁','7-10岁','11-14岁','儿童文学绘本','科普','幼儿启蒙','手工游戏','智力开发','少儿英语','动漫卡通','学前教育','美术','书法','少儿国学']
						},
						dl3:{
							dt:['教育'],
							dd:['教材','中小学教辅','考试','外语学习','字典','词典','课外读物','英语四六级','会计类考试','国家公务员']
						},
						dl4:{
							dt:['文艺'],
							dd:['小说','文学','青春文学','传记','动漫','艺术','摄影','书法','音乐','绘画']
						},
						dl5:{
							dt:['经管励志'],
							dd:['管理','金融与投资','经济','励志与成功','市场营销','股票','智能经济']
						},
						dl6:{
							dt:['人文社科'],
							dd:['历史','心理学','政治/军事','国学/古籍','哲学/宗教','社会科学','法律文化']
						},
						dl7:{
							dt:['生活'],
							dd:['育儿/家教','孕产/胎教','健身保健','旅游/地图','美食时尚','美妆家居','手工DIY','两性体育']
						},
						dl8:{
							dt:['科技'],
							dd:['计算机与互联网','科普','建筑工业','技术电子/通信','医学科学与自然农林']
						},
						dl9:{
							dt:['刊/原版'],
							dd:['杂志/期刊','英文原版书','港台图书']
						},
						dl10:{
							dt:['电子书'],
							dd:['畅读VIP小说','励志与成功','经济','金融','文学','社科','婚恋两性','外文原版','免费']
						},
						dl11:{
							dt:['音像'],
							dd:['音乐','影视','教育音像','游戏','影视/动漫周边','在线教育']
						}
					}
				},
				obj15:{
					channel:['生活娱乐','电影票','机票','火车票','特惠酒店','企业差旅'],
					imglist:{
						brand:['1_1.jpg','1_2.jpg','1_3.jpg','1_4.jpg','1_5.jpg','1_6.jpg','1_7.jpg','1_8.jpg'],
						promotion:['1_1.jpg','1_2.jpg']
					},
					detail:{
						dl1:{
							dt:['交通出行'],
							dd:['国内机票','国际机票','火车票','机场服务','机票套餐']
						},
						dl2:{
							dt:['酒店预订'],
							dd:['国内酒店','国际酒店','超值精选酒店']
						},
						dl3:{
							dt:['旅游度假'],
							dd:['国内旅游','出境旅游','全球签证','景点门票','邮轮旅行','保险']
						},
						dl4:{
							dt:['商旅服务'],
							dd:['企业差旅','团队建设','奖励旅游','会议周边','会议展览']
						},

						dl5:{
							dt:['演出票务'],
							dd:['电影选座','演唱会','音乐会','话剧','歌剧','体育赛事','舞蹈芭蕾','戏曲综艺']
						},
						dl6:{
							dt:['生活缴费'],
							dd:['水费','电费','煤气费','城市通','油卡','充值加油卡']
						},
						dl7:{
							dt:['生活服务'],
							dd:['家政','保洁','摄影写真','休闲娱乐','丽人/养生']
						},
						dl8:{
							dt:['教育培训'],
							dd:['早教','幼教','中小学','教育','语言','培训','学历教育','职业技能','兴趣爱好']
						},
						dl9:{
							dt:['彩票'],
							dd:['购彩中心','开奖结果','数据图表','彩民服务']
						},
						dl10:{
							dt:['游戏'],
							dd:['QQ充值','游戏点卡','网页游戏','游戏周边','手机游戏','单机游戏']
						},
						dl11:{
							dt:['海外生活'],
							dd:['留学','留学后服务','游学','外语培训','海外购物']
						}	
					}
				},
				obj16:{
					imglist:{
						brand:['1_1.jpg','1_2.jpg','1_3.jpg','1_4.jpg','1_5.jpg','1_6.jpg','1_7.jpg','1_8.jpg'],
						promotion:['1_1.jpg','1_2.jpg']
					},
					channel:['金融首页','0元评测','In货推荐'],
					detail:{
						dl1:{
							dt:['理财'],
							dd:['京东小金库','基金理财','定期理财']
						},
						dl2:{
							dt:['众筹'],
							dd:['智能硬件','流行文化','生活美学','公益其他','权益众筹']
						},
						dl3:{
							dt:['东家'],
							dd:['类固收','私募股权','阳光私募','投资策略']
						},
						dl4:{
							dt:['白条'],
							dd:['京东白条','白条联名卡','京东钢镚','旅游白条','安居白条','校园金融','京东金采']
						},
						dl5:{
							dt:['支付'],
							dd:['京东支付']
						},
						dl6:{
							dt:['保险'],
							dd:['车险','健康险','意外险','旅行险']
						},
						dl7:{
							dt:['股票'],
							dd:['实时资讯','市场行情','投资达人','量化平台']
						}
					}
				}
			};

		var cate_pop = document.getElementsByClassName('cate_pop')[0];

			for(var key in cate_data){
				renderItem(cate_data[key]);
			}

			function renderItem(obj){

				var cate_part = document.createElement('div');
				cate_part.className = 'cate_part clearfix';

				var cate_part_col1 = document.createElement('div');
				cate_part_col1.className = 'cate_part_col1';

				var cate_part_col2 = document.createElement('div');
				cate_part_col2.className = 'cate_part_col2';

				cate_part.appendChild(cate_part_col1);
				cate_part.appendChild(cate_part_col2);
				for(var key in obj){

					if(key == 'channel'){

						var cate_channel = document.createElement('div');
						cate_channel.className = 'cate_channel';

						append(cate_channel,obj[key]);

						cate_part_col1.appendChild(cate_channel);
						
					}else if(key == 'detail'){

						var cate_detail = document.createElement('div');
						cate_detail.className = 'cate_detail';

						for(var key1 in obj.detail){
							var dl = document.createElement('dl');

							for(var key2 in obj.detail[key1]){
								var dt = document.createElement('dt');
								var dd = document.createElement('dd');
								if(key2 == 'dt'){
									append(dt,obj.detail[key1][key2]);
									dl.appendChild(dt);
								}else{
									append(dd,obj.detail[key1][key2]);
									dl.appendChild(dd);
								}
							}

							cate_detail.appendChild(dl);
						}

						cate_part_col1.appendChild(cate_detail);

					}else if(key == 'imglist'){
						for(var key3 in obj.imglist){

							if(key3 == 'brand'){
								var cate_brand = document.createElement('div');
								cate_brand.className = 'cate_brand';
								appendImg(cate_brand,obj.imglist[key3],'jd/cate_brand_');

								cate_part_col2.appendChild(cate_brand);
							}else{
								var cate_promotion = document.createElement('div');
								cate_promotion.className = 'cate_promotion';
								appendImg(cate_promotion,obj.imglist[key3],'jd/cate_promotion_');

								cate_part_col2.appendChild(cate_promotion);
							}	
						}
					}
				}

				cate_pop.appendChild(cate_part);
			}
			

			function append(elem,obj){
				for(var i=0,len=obj.length;i<len;i++){
					var a = document.createElement('a');
					a.innerHTML = obj[i];
					a.href = '#';
					elem.appendChild(a);
				}
			}

			function appendImg(elem,obj,prev){
				for(var i=0,len=obj.length;i<len;i++){
					var a = document.createElement('a');
					var img = document.createElement('img');
					img.src = prev+obj[i];
					a.href = '#';
					a.appendChild(img);
					elem.appendChild(a);
				}
			}


			var J_cate = document.getElementsByClassName('J_cate')[0];
			var J_cate_menu = document.getElementsByClassName('J_cate_menu')[0];
			var cate_pop = document.getElementsByClassName('cate_pop')[0];
			var cate_part = cate_pop.getElementsByClassName('cate_part');
			J_cate.onmouseover = function(e){
				var e = e|| window.event;
				var target = e.target;
				if(target.className == 'J_cate_menu_item'){
					removeTagClass(J_cate_menu,' J_cate_menu_item_on','li');
					target.className += ' J_cate_menu_item_on';
					cate_pop.style.display = 'block';
					var index = target.getAttribute('data-index') -1;
					tab_sub_H_and_S(cate_pop,'cate_part',index);
				}
			}
			J_cate.onmouseleave = function(e){
				var e = e|| window.event;
				var target = e.target;
				removeTagClass(J_cate_menu,' J_cate_menu_item_on','li');
				cate_pop.style.display = 'none';
				subHidden(cate_pop,'cate_part');
			}
			
			
	}